package management;

public class Info {
	
	
	/*
	 * 		추상클래스
	 * 	추상클래스는 부모클래스에서(Main)에서 필요한 작업(함수, 객체설정)들을 강제로 설정한 후
	 * 부모클래스가 아닌 개별로 생성된 각각의 클래스에서 작업한 후 해당 식을 불러오기 위해 사용한다
	 * 만약 추상메서드를 사용하지않고 부모클래스 안에서 모든 작업을 하려고하면 Main이 너무 길어지고
	 * 읽기도 어렵고 찾기도 어려워 질 수 있다.
	 * 이를 자식 클래스(개별 클래스)에서 맡은 작업들을 작성(수행)해주고 단축기 처럼 필요한 곳에 쓸수 있다.
	 * 
	 * 추상 클래스
	 * 필요한 공통된 부분(공통 카테고리)들을 정리하게 위해 필요한거고
	 * 
	 * 추상 메서드
	 * 공통된 부분에서도 각각의 다른 부분(속성)들을 정리하고 모으기 위해 필요하다
	 * 
	 * 인터페이스
	 *  부모클래스에서(Main)에서 필요한 작업(함수, 객체설정)들을 강제로 설정하는 것
	 */
}
